Tekla Open API Reference for Tekla Structures 2025
IStringDataType.Value Property
 The string value of the field.
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
string Value { get; set; }
Property Value As String
	Get
	Set
Property Value
Type: String
See Also
Reference
IStringDataType Interface
Tekla.Structures.Datatype Namespace